# Pivot_table
-  https://www.skytowner.com/explore/pandas_pivot_table_method
-  https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html
-  pivot_table(data, index=None, columns=None, values=None)
-  DataFrame.pivot(index=None, columns=None, values=None)

-  data : Is a DataFrame
-  values : Are the numeric data in a given DataFrame, that are to be aggregated.
-  index : Defines the rows of the pivot table
-  columns : Defines the columns of the pivot table

In [1]:
#library
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
mtcars = data('mtcars')
mtcars.reset_index(drop=True, inplace=True)
carID = ['car' + str(n) for n in range(1,33)]
mtcars['carID'] = carID
mtcars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb carID
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4  car1
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4  car2
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1  car3
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1  car4
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2  car5

In [9]:
sum1 = mtcars.groupby(['gear', 'am'])[['carb','wt']].max().reset_index()
sum1

   gear  am  carb     wt
0     3   0     4  5.424
1     4   0     4  3.440
2     4   1     4  2.875
3     5   1     8  3.570

In [11]:
pTable1 = pd.pivot_table(sum1, index =['gear','am','carb'])
pTable1

                 wt
gear am carb
3    0  4     5.424
4    0  4     3.440
     1  4     2.875
5    1  8     3.570

In [13]:
pTable2 = sum1.pivot_table( index=['gear'], aggfunc = {'carb':np.mean, 'wt':np.mean})
pTable2  #skip am col

      carb      wt
gear
3        4  5.4240
4        4  3.1575
5        8  3.5700

In [22]:
pTable3 = sum1.pivot_table( values='wt', index=['gear'], columns= ['am'], aggfunc=np.mean , fill_value=0 )
pTable3  # index=['gear','carb'],

am        0      1
gear
3     5.424  0.000
4     3.440  2.875
5     0.000  3.570

In [23]:
pTable4 = sum1.pivot_table( values='wt', index=['gear'], columns= ['am'], \
                           margins=True, aggfunc=np.mean , fill_value=0 )
pTable4  # index=['gear','carb'],

am        0       1      All
gear
3     5.424  0.0000  5.42400
4     3.440  2.8750  3.15750
5     0.000  3.5700  3.57000
All   4.432  3.2225  3.82725

In [26]:
pTable5 = pd.pivot_table(mtcars, index =['gear'], columns=['carb'] , values='wt', aggfunc='count')
pTable5

carb    1    2    3    4    6    8
gear
3     3.0  4.0  3.0  5.0  NaN  NaN
4     4.0  4.0  NaN  4.0  NaN  NaN
5     NaN  2.0  NaN  1.0  1.0  1.0

In [27]:
pd.pivot_table(mtcars, index =['gear'], columns=['am'] , values='carb', aggfunc='count')

am       0    1
gear
3     15.0  NaN
4      4.0  8.0
5      NaN  5.0

In [34]:
pd.pivot_table(mtcars, index =['gear'], columns=['am'] , values='carb', aggfunc=pd.Series.nunique,\
               margins=True, fill_value='-')
#how many unique carb types are there in each gear and Tx type

am      0    1  All
gear
3     4.0    -    4
4     2.0  3.0    3
5       -  4.0    4
All     4    5    6

### Syntax of Pandas pivot table.
pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc=’mean’, fill_value=None, margins=False, dropna=True, margins_name=’All’, observed=False)

In [5]:
df = pd.DataFrame({"name":["alice","alice","bob","alice","bob","bob"], "year":[2012,2012,2012,2013,2013,2013], "bonus":[10,15,15,10,10,20]})
df

    name  year  bonus
0  alice  2012     10
1  alice  2012     15
2    bob  2012     15
3  alice  2013     10
4    bob  2013     10
5    bob  2013     20

In [16]:
# total bonus of each employee per year. 
#We can do this by creating what is called a pivot table using the pivot_table(~) method:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=np.sum)
#.reset_index(level='year', drop=True)

year   2012  2013
name
alice    25    10
bob      15    30

In [10]:
df.groupby(['name','year']).agg('sum').reset_index()

    name  year  bonus
0  alice  2012     25
1  alice  2013     10
2    bob  2012     15
3    bob  2013     30

In [17]:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=[np.sum, np.mean])

       sum       mean
year  2012 2013  2012  2013
name
alice   25   10  12.5  10.0
bob     15   30  15.0  15.0

In [18]:
# 2 columns
df = pd.DataFrame({"name":["alice","alice","bob","alice","bob","bob"], "year":[2012,2012,2012,2013,2013,2013], "bonus":[10,15,15,10,10,20], "days_absent":[1,2,5,2,3,5]})
df

    name  year  bonus  days_absent
0  alice  2012     10            1
1  alice  2012     15            2
2    bob  2012     15            5
3  alice  2013     10            2
4    bob  2013     10            3
5    bob  2013     20            5

In [19]:
pd.pivot_table(df, values=["bonus","days_absent"], index="name", columns="year", aggfunc=np.sum)

      bonus      days_absent
year   2012 2013        2012 2013
name
alice    25   10           3    2
bob      15   30           5    8

In [20]:
#multiple indices
df = pd.DataFrame({"first_name":["alice","alice","bob","alice","bob","bob"], "last_name":["A","B","A","A","A","B"], "year":[2012,2012,2012,2013,2013,2013], "bonus":[10,15,15,10,10,20]})
df

  first_name last_name  year  bonus
0      alice         A  2012     10
1      alice         B  2012     15
2        bob         A  2012     15
3      alice         A  2013     10
4        bob         A  2013     10
5        bob         B  2013     20

In [21]:
pd.pivot_table(df, values=["bonus"], index=["first_name", "last_name"], 
               columns="year", aggfunc=np.sum)

                     bonus
year                  2012  2013
first_name last_name
alice      A          10.0  10.0
           B          15.0   NaN
bob        A          15.0  10.0
           B           NaN  20.0

In [23]:
#missing value
df = pd.DataFrame({"name":["alice","bob","bob"], "year":[2012,2012,2013], "bonus":[10,15,20]})
df

    name  year  bonus
0  alice  2012     10
1    bob  2012     15
2    bob  2013     20

In [ ]:
#don't have data about Alice's bonus in 2013.
#By default, missing values will be indicated by NaN in the resulting pivot table:

In [24]:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=np.sum, fill_value=-1)

year   2012  2013
name
alice    10    -1
bob      15    20

In [25]:
#margins
df = pd.DataFrame({"name":["alice","bob","alice","bob"], "year":[2012,2012,2013,2013], "bonus":[10,15,20,30]})
df

    name  year  bonus
0  alice  2012     10
1    bob  2012     15
2  alice  2013     20
3    bob  2013     30

In [26]:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=np.sum, margins=True)

year   2012  2013  All
name
alice    10    20   30
bob      15    30   45
All      25    50   75

In [28]:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=np.sum,
               margins=True, margins_name="Total")

year   2012  2013  Total
name
alice    10    20     30
bob      15    30     45
Total    25    50     75

In [29]:
#drop na
df = pd.DataFrame({"name":[np.NaN,np.NaN,"alice","bob"], "year":[2012,2012,2013,2013], "bonus":[10,15,20,25]})
df

    name  year  bonus
0    NaN  2012     10
1    NaN  2012     15
2  alice  2013     20
3    bob  2013     25

In [30]:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=np.sum)

year   2013
name
alice    20
bob      25

In [31]:
pd.pivot_table(df, values="bonus", index="name", columns="year", aggfunc=np.sum, dropna=False)

year   2012  2013
name
alice   NaN    20
bob     NaN    25